[
  {
    "url": "https://arstechnica.com/ai/2025/03/why-anthropics-claude-still-hasnt-beaten-pokemon/",
    "title": "Why Anthropic’s Claude still hasn’t beaten Pokémon",
    "content": "In recent months, the AI industry's biggest boosters have started converging on a public expectation that we're on the verge of “artificial general intelligence” (AGI)—virtual agents that can match or surpass \"human-level\" understanding and performance on most cognitive tasks.\n\nOpenAI is quietly seeding expectations for a \"PhD-level\" AI agent that could operate autonomously at the level of a \"high-income knowledge worker\" in the near future. Elon Musk says that \"we'll have AI smarter than any one human probably\" by the end of 2025. Anthropic CEO Dario Amodei thinks it might take a bit longer but similarly says it's plausible that AI will be \"better than humans at almost everything\" by the end of 2027.\n\nA few researchers at Anthropic have, over the past year, had a part-time obsession with a peculiar problem. Can Claude play Pokémon? A thread: pic.twitter.com/K8SkNXCxYJ — Anthropic (@AnthropicAI) February 25, 2025\n\nLast month, Anthropic presented its “Claude Plays Pokémon” experiment as a waypoint on the road to that predicted AGI future. It's a project the company said shows \"glimmers of AI systems that tackle challenges with increasing competence, not just through training but with generalized reasoning.\" Anthropic made headlines by trumpeting how Claude 3.7 Sonnet’s \"improved reasoning capabilities\" let the company's latest model make progress in the popular old-school Game Boy RPG in ways \"that older models had little hope of achieving.\"\n\nWhile Claude models from just a year ago struggled even to leave the game’s opening area, Claude 3.7 Sonnet was able to make progress by collecting multiple in-game Gym Badges in a relatively small number of in-game actions. That breakthrough, Anthropic wrote, was because the “extended thinking” by Claude 3.7 Sonnet means the new model \"plans ahead, remembers its objectives, and adapts when initial strategies fail\" in a way that its predecessors didn’t. Those things, Anthropic brags, are \"critical skills for battling pixelated gym leaders. And, we posit, in solving real-world problems too.\"\n\nCredit: Anthropic Over the last year, new Claude models have shown quick progress in reaching new Pokémon milestones. Credit: Anthropic Over the last year, new Claude models have shown quick progress in reaching new Pokémon milestones.\n\nBut relative success over previous models is not the same as absolute success over the game in its entirety. In the weeks since Claude Plays Pokémon was first made public, thousands of Twitch viewers have watched Claude struggle to make consistent progress in the game. Despite long \"thinking\" pauses between each move—during which viewers can read printouts of the system’s simulated reasoning process—Claude frequently finds itself pointlessly revisiting completed towns, getting stuck in blind corners of the map for extended periods, or fruitlessly talking to the same unhelpful NPC over and over, to cite just a few examples of distinctly sub-human in-game performance.",
    "date": "2025-03-21T13:49:17Z"
  },
  {
    "url": "https://arstechnica.com/ai/2025/03/why-anthropics-claude-still-hasnt-beaten-pokemon/",
    "title": "Why Anthropic’s Claude still hasn’t beaten Pokémon",
    "content": "In recent months, the AI industry's biggest boosters have started converging on a public expectation that we're on the verge of “artificial general intelligence” (AGI)—virtual agents that can match or surpass \"human-level\" understanding and performance on most cognitive tasks.\n\nOpenAI is quietly seeding expectations for a \"PhD-level\" AI agent that could operate autonomously at the level of a \"high-income knowledge worker\" in the near future. Elon Musk says that \"we'll have AI smarter than any one human probably\" by the end of 2025. Anthropic CEO Dario Amodei thinks it might take a bit longer but similarly says it's plausible that AI will be \"better than humans at almost everything\" by the end of 2027.\n\nA few researchers at Anthropic have, over the past year, had a part-time obsession with a peculiar problem. Can Claude play Pokémon? A thread: pic.twitter.com/K8SkNXCxYJ — Anthropic (@AnthropicAI) February 25, 2025\n\nLast month, Anthropic presented its “Claude Plays Pokémon” experiment as a waypoint on the road to that predicted AGI future. It's a project the company said shows \"glimmers of AI systems that tackle challenges with increasing competence, not just through training but with generalized reasoning.\" Anthropic made headlines by trumpeting how Claude 3.7 Sonnet’s \"improved reasoning capabilities\" let the company's latest model make progress in the popular old-school Game Boy RPG in ways \"that older models had little hope of achieving.\"\n\nWhile Claude models from just a year ago struggled even to leave the game’s opening area, Claude 3.7 Sonnet was able to make progress by collecting multiple in-game Gym Badges in a relatively small number of in-game actions. That breakthrough, Anthropic wrote, was because the “extended thinking” by Claude 3.7 Sonnet means the new model \"plans ahead, remembers its objectives, and adapts when initial strategies fail\" in a way that its predecessors didn’t. Those things, Anthropic brags, are \"critical skills for battling pixelated gym leaders. And, we posit, in solving real-world problems too.\"\n\nCredit: Anthropic Over the last year, new Claude models have shown quick progress in reaching new Pokémon milestones. Credit: Anthropic Over the last year, new Claude models have shown quick progress in reaching new Pokémon milestones.\n\nBut relative success over previous models is not the same as absolute success over the game in its entirety. In the weeks since Claude Plays Pokémon was first made public, thousands of Twitch viewers have watched Claude struggle to make consistent progress in the game. Despite long \"thinking\" pauses between each move—during which viewers can read printouts of the system’s simulated reasoning process—Claude frequently finds itself pointlessly revisiting completed towns, getting stuck in blind corners of the map for extended periods, or fruitlessly talking to the same unhelpful NPC over and over, to cite just a few examples of distinctly sub-human in-game performance.",
    "date": "2025-03-21T13:49:17Z"
  },
  {
    "url": "http://9to5google.com/2025/03/21/samsung-galaxy-android-15-initial-list/",
    "title": "Samsung confirms initial list of Galaxy devices getting Android 15",
    "content": "One UI 7 is finally nearing the end of testing and will soon be available to users in a stable format starting in April outside of the Galaxy S25 series. Samsung listed a number of Galaxy devices that would be eligible for the Android 15 update repackaged as Samsung’s One UI 7.\n\nOne UI 7 carries a hefty number of changes that could potentially go unnoticed if the user doesn’t really care about AI. Fortunately, Samsung has been doing a good job of inserting AI features that don’t come off as gimmicks, like translation and messaging tools. One UI 7 also brings a different approach to notifications and Quick Settings, which is a divisive one.\n\nSamsung’s Android 15 update was originally rolled out with the Galaxy S25 series. The Galaxy S24 lineup and foldable have been left in a beta phase that has lasted longer than anticipated. So what comes next?\n\nAccording to Samsung, Android 15 will officially roll out to over 15 devices starting on April 7. Samsung provided a small list of devices getting the update, to begin with, which includes some devices that were left in beta for way too long.\n\nAdvertisement - scroll for more content\n\nIt looks like Samsung will start with the Galaxy S24 series and work its way backward through the S series.\n\nGalaxy S24 series\n\nGalaxy S24 FE\n\nGalaxy S23 series\n\nGalaxy S23 FE\n\nGalaxy S22 series\n\nGalaxy S21 series\n\nGalaxy S21 FE\n\nSamsung also plans to bring Android 15 to foldables, spanning all the way back to the Galaxy Z Fold/Flip 3. Beyond that, the Galaxy Tab S10 and S9 series will get the update, though it’s unclear if that includes the FE models.\n\nGalaxy Z Fold 6\n\nGalaxy Z Flip 6\n\nGalaxy Z Fold 5\n\nGalaxy Z Flip 5\n\nGalaxy Z Fold 4\n\nGalaxy Z Flip 4\n\nGalaxy Z Fold 3\n\nGalaxy Z Flip 3\n\nGalaxy Tab S10 series\n\nGalaxy Tab S9 series\n\nGalaxy Tab S9 FE series\n\nGalaxy Tab S8 series\n\nGalaxy Tab S6 Lite\n\nDetails on timing are pretty scarce, and they’ll likely remain so as Samsung will likely play the majority of the rollout by ear as updates become available. The S24 series will very likely be first, with the following lineups coming in close behind. The list may also expand to more devices in time. This is a big step in the right direction, though the OS upgrade has been far delayed already.\n\nMore on Samsung:",
    "date": "2025-03-21T13:20:48Z"
  },
  {
    "url": "https://www.eurogamer.net/nintendo-switch-online-adding-four-more-snes-games",
    "title": "Nintendo Switch Online adding four more SNES games",
    "content": "Nintendo has announced its next batch of SNES games headed to the Switch Online catalogue - and there's a pretty obvious nod to Assassin's Creed Shadows on the list.\n\nFour strategy games from Koei all arrive for Switch Online next Friday, 28th March, including two Nobunaga's Ambition titles.\n\nNobunaga's Ambition lets you compete for control of Japan either as the infamous Oda Nobunaga or his rivals as they attempt to unify the country. This is the same conflict that plays out over the course of Ubisoft's new Feudal Japan-set Assassin's Creed, in which Oda Nobunaga is also a key figure.\n\nComing to Nintendo Switch Online next week are:\n\nNobunaga's Ambition\n\nNobunaga's Ambition: Lord of Darkness\n\nRomance of the Three Kingdoms 4: Wall of Fire\n\nUncharted Water: New Horizons\n\nAnd you can watch footage of all four games in the video below:\n\n28th March is also when SNES game Super Soccer will be delisted from Nintendo's Switch Online catalogue, at least in Japan - the first game to disappear from the subscription service.\n\nEurogamer previously contacted Nintendo for more information on why the game will be removed, and whether this removal will also take place elsewhere in the world. We're yet to receive any more information there.\n\nYou can check out the full run down of everything available on Nintendo's subscription service via our handy guide detailing all the Nintendo Switch Online games available to play right now.",
    "date": "2025-03-21T10:41:21Z"
  },
  {
    "url": "https://www.wired.com/story/google-openai-gemini-chatgpt-artificial-intelligence/",
    "title": "Inside Google’s Two-Year Frenzy to Catch Up With OpenAI",
    "content": "But more piles of fascinating research are only useful to Google if they generate that most important of outputs: profit. Most customers generally aren’t yet willing to pay for AI features directly, so the company may be looking to sell ads in the Gemini app. That’s a classic strategy for Google, of course, one that long ago spread to the rest of Silicon Valley: Give us your data, your time, and your attention, check the box on our terms of service that releases us from liability, and we won’t charge you a dime for this cool tool we built.\n\nFor now, according to data from Sensor Tower, OpenAI’s estimated 600 million all-time global app installs for ChatGPT dwarf Google’s 140 million for the Gemini app. And there are plenty of other chatbots in this AI race too—Claude, Copilot, Grok, DeepSeek, Llama, Perplexity—many of them backed by Google’s biggest and best-funded competitors (or, in the case of Claude, Google itself). The entire industry, not just Google, struggles with the fact that generative AI systems have required billions of dollars in investment, so far unrecouped, and huge amounts of energy, enough to extend the lives of decades-old coal plants and nuclear reactors. Companies insist that efficiencies are adding up every day. They also hope to drive down errors to the point of winning over more users. But no one has truly figured out how to generate a reliable return or spare the climate.\n\nAnd Google faces one challenge that its competitors don’t: In the coming years, up to a quarter of its search ad revenue could be lost to antitrust judgments, according to JP Morgan analyst Doug Anmuth. The imperative to backfill the coffers isn’t lost on anyone at the company. Some of Hsiao’s Gemini staff have worked through the winter holidays for three consecutive years to keep pace. Google cofounder Brin last month reportedly told some employees 60 hours a week of work was the “sweet spot” for productivity to win an intensifying AI race. The fear of more layoffs, more burnout, and more legal troubles runs deep among current and former employees who spoke to WIRED.\n\nOne Google researcher and a high-ranking colleague say the pervasive feeling is unease. Generative AI clearly is helpful. Even governments that are prone to regulating big tech, such as France’s, are warming up to the technology’s lofty promises. Inside Google DeepMind and during public talks, Hassabis hasn’t relented an inch from his goal of creating artificial general intelligence, a system capable of human-level cognition across a range of tasks. He spends occasional weekends walking around London with his Astra prototype, getting a taste of a future in which the entire physical world, from that Thames duck over there to this Georgian manor over here, is searchable. But AGI will require systems to get better at reasoning, planning, and taking charge.\n\nIn January, OpenAI took a step toward that future by letting the public in on another experiment: its long-awaited Operator service, a so-called agentic AI that can act well beyond the chatbot window. Operator can click and type on websites just as a person would to execute chores like booking a trip or filling out a form. For the moment, it performs these tasks much more slowly and cautiously than a human would, and at a steep cost for its unreliability (available as part of a $200 monthly plan). Google, naturally, is working to bring agentic features to its coming models too. Where the current Gemini can help you develop a meal plan, the next one will place your ingredients in an online shopping cart. Maybe the one after that will give you real-time feedback on your onion-chopping technique.\n\nAs always, moving quickly may mean gaffing often. In late January, before the Super Bowl, Google released an ad in which Gemini was caught in a slipup even more laughably wrong than Bard’s telescope mistake: It estimated that half or more of all the cheese consumed on Earth is gouda. As Gemini grows from a sometimes-credible facts machine to an intimate part of human lives—life coach, all-seeing assistant—Pichai says that Google is proceeding cautiously. Back on top at last, though, he and the other Google executives may never want to get caught from behind again. The race goes on.\n\nUpdated 3/21/2025, 4 PM EDT: Wired has clarified the context of a quote attributed to Pandu Nayak.\n\nLet us know what you think about this article. Submit a letter to the editor at mail@wired.com.",
    "date": "2025-03-21T10:00:00Z"
  },
  {
    "url": "https://www.ign.com/articles/assassins-creed-shadows-crosses-1-million-players-on-launch-day-ubisoft-says",
    "title": "Assassin’s Creed Shadows Crosses 1 Million Players on Launch Day, Ubisoft Says",
    "content": "Assassin’s Creed Shadows saw over 1 million players on launch day, Ubisoft has announced.\n\nThe game released on PC, PlayStation 5, and Xbox Series X and S on March 20, and just before 4pm in Canada, Ubisoft took to social media to say it had crossed the 1 million player mark.\n\n“It's not even 4pm here in Canada and Assassin's Creed Shadows has already passed 1 million players!” Ubisoft said.\n\n“Thank YOU from the bottom of our hearts for joining this adventure in Feudal Japan. We are beyond excited to start this journey with you!”\n\nPlay\n\nWhile 1 million players on launch day is an impressive achievement, it’s difficult to gauge success when Ubisoft itself hasn’t offered a sales figure or indeed a sales target.\n\nWhat we do know is that Assassin’s Creed Shadows is the top-selling video game globally on Steam right now. Valve’s chart sorts products by revenue, so we can say Ubisoft’s game is currently bringing in more money than any other on the platform.\n\nWe also have early days Steam concurrent figures. According to official stats from Valve’s platform, Assassin’s Creed Shadows hit a peak player concurrent figure of 41,412 on Steam on launch day. Assassin’s Creed Shadows released on a Thursday, so it is expected that that figure will grow as we head into the game’s first weekend on sale. We’ll have a better picture of its performance on Steam next week and in the weeks ahead. Neither Sony nor Microsoft make player numbers public.\n\nFor some context, BioWare’s single-player RPG Dragon Age: The Veilguard launched on Steam on Thursday, October 31, 2024, and saw a peak of 70,414 players on Valve’s platform.\n\nThe Complete Assassin's Creed Timeline 25 Images\n\nThere is enormous pressure on Assassin's Creed Shadows to do well for Ubisoft globally after multiple delays and the sales failure of last year’s Star Wars Outlaws . Indeed, Ubisoft has suffered a number of high-profile flops , layoffs , studio closures , and game cancellations in the run up to Assassin's Creed Shadows' release. Things have got so bad at Ubisoft that its founding Guillemot family and largest shareholder have reportedly been exploring talks with Chinese mega-corp Tencent and other investors on a buyout deal that would let them preserve control.\n\nAssassin's Creed Shadows has also endured a number of controversies, not least in Japan. Yesterday, IGN confirmed that Ubisoft had quietly released a day-one patch for Assassin’s Creed Shadows that made a number of important changes seemingly in response to concern from some Japanese politicians about in-game temples and shrines.\n\nIn a remarkable exchange this week, Japanese politician and member of the House of Councillors of Japan, Hiroyuki Kada, raised the issue of Assassin’s Creed Shadows in an official government meeting, and Shigeru Ishiba, the Prime Minister of Japan, responded.\n\nAssassin's Creed Shadows - Early Skills Tier List Assassin's Creed Shadows - Early Skills Tier List\n\nOn Steam at least, Assassin's Creed Shadows is going down very well with players. It has a 'very positive' user review rating, with 82% of the near 4,000 user reviews marked as positive. IGN’s Assassin’s Creed Shadows review returned an 8/10. We said: “By sharpening the edges of its existing systems, Assassin’s Creed Shadows creates one of the best versions of the open-world style it’s been honing for the last decade.”\n\nAdventuring across feudal Japan? Check out our comprehensive Assassin's Creed Shadows guide, including our Assassin's Creed Shadows walkthrough, our detailed Assassin's Creed Shadows Interactive Map, and our guide to all the crucial things Assassin’s Creed Shadows doesn’t tell you.\n\nWesley is the UK News Editor for IGN. Find him on Twitter at @wyp100. You can reach Wesley at wesley_yinpoole@ign.com or confidentially at wyp100@proton.me.",
    "date": "2025-03-21T09:50:35Z"
  },
  {
    "url": "https://arstechnica.com/ai/2025/03/why-anthropics-claude-still-hasnt-beaten-pokemon/",
    "title": "Why Anthropic’s Claude still hasn’t beaten Pokémon",
    "content": "In recent months, the AI industry's biggest boosters have started converging on a public expectation that we're on the verge of “artificial general intelligence” (AGI)—virtual agents that can match or surpass \"human-level\" understanding and performance on most cognitive tasks.\n\nOpenAI is quietly seeding expectations for a \"PhD-level\" AI agent that could operate autonomously at the level of a \"high-income knowledge worker\" in the near future. Elon Musk says that \"we'll have AI smarter than any one human probably\" by the end of 2025. Anthropic CEO Dario Amodei thinks it might take a bit longer but similarly says it's plausible that AI will be \"better than humans at almost everything\" by the end of 2027.\n\nA few researchers at Anthropic have, over the past year, had a part-time obsession with a peculiar problem. Can Claude play Pokémon? A thread: pic.twitter.com/K8SkNXCxYJ — Anthropic (@AnthropicAI) February 25, 2025\n\nLast month, Anthropic presented its “Claude Plays Pokémon” experiment as a waypoint on the road to that predicted AGI future. It's a project the company said shows \"glimmers of AI systems that tackle challenges with increasing competence, not just through training but with generalized reasoning.\" Anthropic made headlines by trumpeting how Claude 3.7 Sonnet’s \"improved reasoning capabilities\" let the company's latest model make progress in the popular old-school Game Boy RPG in ways \"that older models had little hope of achieving.\"\n\nWhile Claude models from just a year ago struggled even to leave the game’s opening area, Claude 3.7 Sonnet was able to make progress by collecting multiple in-game Gym Badges in a relatively small number of in-game actions. That breakthrough, Anthropic wrote, was because the “extended thinking” by Claude 3.7 Sonnet means the new model \"plans ahead, remembers its objectives, and adapts when initial strategies fail\" in a way that its predecessors didn’t. Those things, Anthropic brags, are \"critical skills for battling pixelated gym leaders. And, we posit, in solving real-world problems too.\"\n\nCredit: Anthropic Over the last year, new Claude models have shown quick progress in reaching new Pokémon milestones. Credit: Anthropic Over the last year, new Claude models have shown quick progress in reaching new Pokémon milestones.\n\nBut relative success over previous models is not the same as absolute success over the game in its entirety. In the weeks since Claude Plays Pokémon was first made public, thousands of Twitch viewers have watched Claude struggle to make consistent progress in the game. Despite long \"thinking\" pauses between each move—during which viewers can read printouts of the system’s simulated reasoning process—Claude frequently finds itself pointlessly revisiting completed towns, getting stuck in blind corners of the map for extended periods, or fruitlessly talking to the same unhelpful NPC over and over, to cite just a few examples of distinctly sub-human in-game performance.",
    "date": "2025-03-21T13:49:17Z"
  },
  {
    "url": "http://9to5google.com/2025/03/21/samsung-galaxy-android-15-initial-list/",
    "title": "Samsung confirms initial list of Galaxy devices getting Android 15",
    "content": "One UI 7 is finally nearing the end of testing and will soon be available to users in a stable format starting in April outside of the Galaxy S25 series. Samsung listed a number of Galaxy devices that would be eligible for the Android 15 update repackaged as Samsung’s One UI 7.\n\nOne UI 7 carries a hefty number of changes that could potentially go unnoticed if the user doesn’t really care about AI. Fortunately, Samsung has been doing a good job of inserting AI features that don’t come off as gimmicks, like translation and messaging tools. One UI 7 also brings a different approach to notifications and Quick Settings, which is a divisive one.\n\nSamsung’s Android 15 update was originally rolled out with the Galaxy S25 series. The Galaxy S24 lineup and foldable have been left in a beta phase that has lasted longer than anticipated. So what comes next?\n\nAccording to Samsung, Android 15 will officially roll out to over 15 devices starting on April 7. Samsung provided a small list of devices getting the update, to begin with, which includes some devices that were left in beta for way too long.\n\nAdvertisement - scroll for more content\n\nIt looks like Samsung will start with the Galaxy S24 series and work its way backward through the S series.\n\nGalaxy S24 series\n\nGalaxy S24 FE\n\nGalaxy S23 series\n\nGalaxy S23 FE\n\nGalaxy S22 series\n\nGalaxy S21 series\n\nGalaxy S21 FE\n\nSamsung also plans to bring Android 15 to foldables, spanning all the way back to the Galaxy Z Fold/Flip 3. Beyond that, the Galaxy Tab S10 and S9 series will get the update, though it’s unclear if that includes the FE models.\n\nGalaxy Z Fold 6\n\nGalaxy Z Flip 6\n\nGalaxy Z Fold 5\n\nGalaxy Z Flip 5\n\nGalaxy Z Fold 4\n\nGalaxy Z Flip 4\n\nGalaxy Z Fold 3\n\nGalaxy Z Flip 3\n\nGalaxy Tab S10 series\n\nGalaxy Tab S9 series\n\nGalaxy Tab S9 FE series\n\nGalaxy Tab S8 series\n\nGalaxy Tab S6 Lite\n\nDetails on timing are pretty scarce, and they’ll likely remain so as Samsung will likely play the majority of the rollout by ear as updates become available. The S24 series will very likely be first, with the following lineups coming in close behind. The list may also expand to more devices in time. This is a big step in the right direction, though the OS upgrade has been far delayed already.\n\nMore on Samsung:",
    "date": "2025-03-21T13:20:48Z"
  },
  {
    "url": "https://www.eurogamer.net/nintendo-switch-online-adding-four-more-snes-games",
    "title": "Nintendo Switch Online adding four more SNES games",
    "content": "Nintendo has announced its next batch of SNES games headed to the Switch Online catalogue - and there's a pretty obvious nod to Assassin's Creed Shadows on the list.\n\nFour strategy games from Koei all arrive for Switch Online next Friday, 28th March, including two Nobunaga's Ambition titles.\n\nNobunaga's Ambition lets you compete for control of Japan either as the infamous Oda Nobunaga or his rivals as they attempt to unify the country. This is the same conflict that plays out over the course of Ubisoft's new Feudal Japan-set Assassin's Creed, in which Oda Nobunaga is also a key figure.\n\nComing to Nintendo Switch Online next week are:\n\nNobunaga's Ambition\n\nNobunaga's Ambition: Lord of Darkness\n\nRomance of the Three Kingdoms 4: Wall of Fire\n\nUncharted Water: New Horizons\n\nAnd you can watch footage of all four games in the video below:\n\n28th March is also when SNES game Super Soccer will be delisted from Nintendo's Switch Online catalogue, at least in Japan - the first game to disappear from the subscription service.\n\nEurogamer previously contacted Nintendo for more information on why the game will be removed, and whether this removal will also take place elsewhere in the world. We're yet to receive any more information there.\n\nYou can check out the full run down of everything available on Nintendo's subscription service via our handy guide detailing all the Nintendo Switch Online games available to play right now.",
    "date": "2025-03-21T10:41:21Z"
  },
  {
    "url": "https://www.wired.com/story/google-openai-gemini-chatgpt-artificial-intelligence/",
    "title": "Inside Google’s Two-Year Frenzy to Catch Up With OpenAI",
    "content": "But more piles of fascinating research are only useful to Google if they generate that most important of outputs: profit. Most customers generally aren’t yet willing to pay for AI features directly, so the company may be looking to sell ads in the Gemini app. That’s a classic strategy for Google, of course, one that long ago spread to the rest of Silicon Valley: Give us your data, your time, and your attention, check the box on our terms of service that releases us from liability, and we won’t charge you a dime for this cool tool we built.\n\nFor now, according to data from Sensor Tower, OpenAI’s estimated 600 million all-time global app installs for ChatGPT dwarf Google’s 140 million for the Gemini app. And there are plenty of other chatbots in this AI race too—Claude, Copilot, Grok, DeepSeek, Llama, Perplexity—many of them backed by Google’s biggest and best-funded competitors (or, in the case of Claude, Google itself). The entire industry, not just Google, struggles with the fact that generative AI systems have required billions of dollars in investment, so far unrecouped, and huge amounts of energy, enough to extend the lives of decades-old coal plants and nuclear reactors. Companies insist that efficiencies are adding up every day. They also hope to drive down errors to the point of winning over more users. But no one has truly figured out how to generate a reliable return or spare the climate.\n\nAnd Google faces one challenge that its competitors don’t: In the coming years, up to a quarter of its search ad revenue could be lost to antitrust judgments, according to JP Morgan analyst Doug Anmuth. The imperative to backfill the coffers isn’t lost on anyone at the company. Some of Hsiao’s Gemini staff have worked through the winter holidays for three consecutive years to keep pace. Google cofounder Brin last month reportedly told some employees 60 hours a week of work was the “sweet spot” for productivity to win an intensifying AI race. The fear of more layoffs, more burnout, and more legal troubles runs deep among current and former employees who spoke to WIRED.\n\nOne Google researcher and a high-ranking colleague say the pervasive feeling is unease. Generative AI clearly is helpful. Even governments that are prone to regulating big tech, such as France’s, are warming up to the technology’s lofty promises. Inside Google DeepMind and during public talks, Hassabis hasn’t relented an inch from his goal of creating artificial general intelligence, a system capable of human-level cognition across a range of tasks. He spends occasional weekends walking around London with his Astra prototype, getting a taste of a future in which the entire physical world, from that Thames duck over there to this Georgian manor over here, is searchable. But AGI will require systems to get better at reasoning, planning, and taking charge.\n\nIn January, OpenAI took a step toward that future by letting the public in on another experiment: its long-awaited Operator service, a so-called agentic AI that can act well beyond the chatbot window. Operator can click and type on websites just as a person would to execute chores like booking a trip or filling out a form. For the moment, it performs these tasks much more slowly and cautiously than a human would, and at a steep cost for its unreliability (available as part of a $200 monthly plan). Google, naturally, is working to bring agentic features to its coming models too. Where the current Gemini can help you develop a meal plan, the next one will place your ingredients in an online shopping cart. Maybe the one after that will give you real-time feedback on your onion-chopping technique.\n\nAs always, moving quickly may mean gaffing often. In late January, before the Super Bowl, Google released an ad in which Gemini was caught in a slipup even more laughably wrong than Bard’s telescope mistake: It estimated that half or more of all the cheese consumed on Earth is gouda. As Gemini grows from a sometimes-credible facts machine to an intimate part of human lives—life coach, all-seeing assistant—Pichai says that Google is proceeding cautiously. Back on top at last, though, he and the other Google executives may never want to get caught from behind again. The race goes on.\n\nUpdated 3/21/2025, 4 PM EDT: Wired has clarified the context of a quote attributed to Pandu Nayak.\n\nLet us know what you think about this article. Submit a letter to the editor at mail@wired.com.",
    "date": "2025-03-21T10:00:00Z"
  },
  {
    "url": "https://www.ign.com/articles/assassins-creed-shadows-crosses-1-million-players-on-launch-day-ubisoft-says",
    "title": "Assassin’s Creed Shadows Crosses 1 Million Players on Launch Day, Ubisoft Says",
    "content": "Assassin’s Creed Shadows saw over 1 million players on launch day, Ubisoft has announced.\n\nThe game released on PC, PlayStation 5, and Xbox Series X and S on March 20, and just before 4pm in Canada, Ubisoft took to social media to say it had crossed the 1 million player mark.\n\n“It's not even 4pm here in Canada and Assassin's Creed Shadows has already passed 1 million players!” Ubisoft said.\n\n“Thank YOU from the bottom of our hearts for joining this adventure in Feudal Japan. We are beyond excited to start this journey with you!”\n\nPlay\n\nWhile 1 million players on launch day is an impressive achievement, it’s difficult to gauge success when Ubisoft itself hasn’t offered a sales figure or indeed a sales target.\n\nWhat we do know is that Assassin’s Creed Shadows is the top-selling video game globally on Steam right now. Valve’s chart sorts products by revenue, so we can say Ubisoft’s game is currently bringing in more money than any other on the platform.\n\nWe also have early days Steam concurrent figures. According to official stats from Valve’s platform, Assassin’s Creed Shadows hit a peak player concurrent figure of 41,412 on Steam on launch day. Assassin’s Creed Shadows released on a Thursday, so it is expected that that figure will grow as we head into the game’s first weekend on sale. We’ll have a better picture of its performance on Steam next week and in the weeks ahead. Neither Sony nor Microsoft make player numbers public.\n\nFor some context, BioWare’s single-player RPG Dragon Age: The Veilguard launched on Steam on Thursday, October 31, 2024, and saw a peak of 70,414 players on Valve’s platform.\n\nThe Complete Assassin's Creed Timeline 25 Images\n\nThere is enormous pressure on Assassin's Creed Shadows to do well for Ubisoft globally after multiple delays and the sales failure of last year’s Star Wars Outlaws . Indeed, Ubisoft has suffered a number of high-profile flops , layoffs , studio closures , and game cancellations in the run up to Assassin's Creed Shadows' release. Things have got so bad at Ubisoft that its founding Guillemot family and largest shareholder have reportedly been exploring talks with Chinese mega-corp Tencent and other investors on a buyout deal that would let them preserve control.\n\nAssassin's Creed Shadows has also endured a number of controversies, not least in Japan. Yesterday, IGN confirmed that Ubisoft had quietly released a day-one patch for Assassin’s Creed Shadows that made a number of important changes seemingly in response to concern from some Japanese politicians about in-game temples and shrines.\n\nIn a remarkable exchange this week, Japanese politician and member of the House of Councillors of Japan, Hiroyuki Kada, raised the issue of Assassin’s Creed Shadows in an official government meeting, and Shigeru Ishiba, the Prime Minister of Japan, responded.\n\nAssassin's Creed Shadows - Early Skills Tier List Assassin's Creed Shadows - Early Skills Tier List\n\nOn Steam at least, Assassin's Creed Shadows is going down very well with players. It has a 'very positive' user review rating, with 82% of the near 4,000 user reviews marked as positive. IGN’s Assassin’s Creed Shadows review returned an 8/10. We said: “By sharpening the edges of its existing systems, Assassin’s Creed Shadows creates one of the best versions of the open-world style it’s been honing for the last decade.”\n\nAdventuring across feudal Japan? Check out our comprehensive Assassin's Creed Shadows guide, including our Assassin's Creed Shadows walkthrough, our detailed Assassin's Creed Shadows Interactive Map, and our guide to all the crucial things Assassin’s Creed Shadows doesn’t tell you.\n\nWesley is the UK News Editor for IGN. Find him on Twitter at @wyp100. You can reach Wesley at wesley_yinpoole@ign.com or confidentially at wyp100@proton.me.",
    "date": "2025-03-21T09:50:35Z"
  },
  {
    "url": "https://arstechnica.com/ai/2025/03/why-anthropics-claude-still-hasnt-beaten-pokemon/",
    "title": "Why Anthropic’s Claude still hasn’t beaten Pokémon",
    "content": "In recent months, the AI industry's biggest boosters have started converging on a public expectation that we're on the verge of “artificial general intelligence” (AGI)—virtual agents that can match or surpass \"human-level\" understanding and performance on most cognitive tasks.\n\nOpenAI is quietly seeding expectations for a \"PhD-level\" AI agent that could operate autonomously at the level of a \"high-income knowledge worker\" in the near future. Elon Musk says that \"we'll have AI smarter than any one human probably\" by the end of 2025. Anthropic CEO Dario Amodei thinks it might take a bit longer but similarly says it's plausible that AI will be \"better than humans at almost everything\" by the end of 2027.\n\nA few researchers at Anthropic have, over the past year, had a part-time obsession with a peculiar problem. Can Claude play Pokémon? A thread: pic.twitter.com/K8SkNXCxYJ — Anthropic (@AnthropicAI) February 25, 2025\n\nLast month, Anthropic presented its “Claude Plays Pokémon” experiment as a waypoint on the road to that predicted AGI future. It's a project the company said shows \"glimmers of AI systems that tackle challenges with increasing competence, not just through training but with generalized reasoning.\" Anthropic made headlines by trumpeting how Claude 3.7 Sonnet’s \"improved reasoning capabilities\" let the company's latest model make progress in the popular old-school Game Boy RPG in ways \"that older models had little hope of achieving.\"\n\nWhile Claude models from just a year ago struggled even to leave the game’s opening area, Claude 3.7 Sonnet was able to make progress by collecting multiple in-game Gym Badges in a relatively small number of in-game actions. That breakthrough, Anthropic wrote, was because the “extended thinking” by Claude 3.7 Sonnet means the new model \"plans ahead, remembers its objectives, and adapts when initial strategies fail\" in a way that its predecessors didn’t. Those things, Anthropic brags, are \"critical skills for battling pixelated gym leaders. And, we posit, in solving real-world problems too.\"\n\nCredit: Anthropic Over the last year, new Claude models have shown quick progress in reaching new Pokémon milestones. Credit: Anthropic Over the last year, new Claude models have shown quick progress in reaching new Pokémon milestones.\n\nBut relative success over previous models is not the same as absolute success over the game in its entirety. In the weeks since Claude Plays Pokémon was first made public, thousands of Twitch viewers have watched Claude struggle to make consistent progress in the game. Despite long \"thinking\" pauses between each move—during which viewers can read printouts of the system’s simulated reasoning process—Claude frequently finds itself pointlessly revisiting completed towns, getting stuck in blind corners of the map for extended periods, or fruitlessly talking to the same unhelpful NPC over and over, to cite just a few examples of distinctly sub-human in-game performance.",
    "date": "2025-03-21T13:49:17Z"
  },
  {
    "url": "http://9to5google.com/2025/03/21/samsung-galaxy-android-15-initial-list/",
    "title": "Samsung confirms initial list of Galaxy devices getting Android 15",
    "content": "One UI 7 is finally nearing the end of testing and will soon be available to users in a stable format starting in April outside of the Galaxy S25 series. Samsung listed a number of Galaxy devices that would be eligible for the Android 15 update repackaged as Samsung’s One UI 7.\n\nOne UI 7 carries a hefty number of changes that could potentially go unnoticed if the user doesn’t really care about AI. Fortunately, Samsung has been doing a good job of inserting AI features that don’t come off as gimmicks, like translation and messaging tools. One UI 7 also brings a different approach to notifications and Quick Settings, which is a divisive one.\n\nSamsung’s Android 15 update was originally rolled out with the Galaxy S25 series. The Galaxy S24 lineup and foldable have been left in a beta phase that has lasted longer than anticipated. So what comes next?\n\nAccording to Samsung, Android 15 will officially roll out to over 15 devices starting on April 7. Samsung provided a small list of devices getting the update, to begin with, which includes some devices that were left in beta for way too long.\n\nAdvertisement - scroll for more content\n\nIt looks like Samsung will start with the Galaxy S24 series and work its way backward through the S series.\n\nGalaxy S24 series\n\nGalaxy S24 FE\n\nGalaxy S23 series\n\nGalaxy S23 FE\n\nGalaxy S22 series\n\nGalaxy S21 series\n\nGalaxy S21 FE\n\nSamsung also plans to bring Android 15 to foldables, spanning all the way back to the Galaxy Z Fold/Flip 3. Beyond that, the Galaxy Tab S10 and S9 series will get the update, though it’s unclear if that includes the FE models.\n\nGalaxy Z Fold 6\n\nGalaxy Z Flip 6\n\nGalaxy Z Fold 5\n\nGalaxy Z Flip 5\n\nGalaxy Z Fold 4\n\nGalaxy Z Flip 4\n\nGalaxy Z Fold 3\n\nGalaxy Z Flip 3\n\nGalaxy Tab S10 series\n\nGalaxy Tab S9 series\n\nGalaxy Tab S9 FE series\n\nGalaxy Tab S8 series\n\nGalaxy Tab S6 Lite\n\nDetails on timing are pretty scarce, and they’ll likely remain so as Samsung will likely play the majority of the rollout by ear as updates become available. The S24 series will very likely be first, with the following lineups coming in close behind. The list may also expand to more devices in time. This is a big step in the right direction, though the OS upgrade has been far delayed already.\n\nMore on Samsung:",
    "date": "2025-03-21T13:20:48Z"
  },
  {
    "url": "https://www.eurogamer.net/nintendo-switch-online-adding-four-more-snes-games",
    "title": "Nintendo Switch Online adding four more SNES games",
    "content": "Nintendo has announced its next batch of SNES games headed to the Switch Online catalogue - and there's a pretty obvious nod to Assassin's Creed Shadows on the list.\n\nFour strategy games from Koei all arrive for Switch Online next Friday, 28th March, including two Nobunaga's Ambition titles.\n\nNobunaga's Ambition lets you compete for control of Japan either as the infamous Oda Nobunaga or his rivals as they attempt to unify the country. This is the same conflict that plays out over the course of Ubisoft's new Feudal Japan-set Assassin's Creed, in which Oda Nobunaga is also a key figure.\n\nComing to Nintendo Switch Online next week are:\n\nNobunaga's Ambition\n\nNobunaga's Ambition: Lord of Darkness\n\nRomance of the Three Kingdoms 4: Wall of Fire\n\nUncharted Water: New Horizons\n\nAnd you can watch footage of all four games in the video below:\n\n28th March is also when SNES game Super Soccer will be delisted from Nintendo's Switch Online catalogue, at least in Japan - the first game to disappear from the subscription service.\n\nEurogamer previously contacted Nintendo for more information on why the game will be removed, and whether this removal will also take place elsewhere in the world. We're yet to receive any more information there.\n\nYou can check out the full run down of everything available on Nintendo's subscription service via our handy guide detailing all the Nintendo Switch Online games available to play right now.",
    "date": "2025-03-21T10:41:21Z"
  },
  {
    "url": "https://www.wired.com/story/google-openai-gemini-chatgpt-artificial-intelligence/",
    "title": "Inside Google’s Two-Year Frenzy to Catch Up With OpenAI",
    "content": "But more piles of fascinating research are only useful to Google if they generate that most important of outputs: profit. Most customers generally aren’t yet willing to pay for AI features directly, so the company may be looking to sell ads in the Gemini app. That’s a classic strategy for Google, of course, one that long ago spread to the rest of Silicon Valley: Give us your data, your time, and your attention, check the box on our terms of service that releases us from liability, and we won’t charge you a dime for this cool tool we built.\n\nFor now, according to data from Sensor Tower, OpenAI’s estimated 600 million all-time global app installs for ChatGPT dwarf Google’s 140 million for the Gemini app. And there are plenty of other chatbots in this AI race too—Claude, Copilot, Grok, DeepSeek, Llama, Perplexity—many of them backed by Google’s biggest and best-funded competitors (or, in the case of Claude, Google itself). The entire industry, not just Google, struggles with the fact that generative AI systems have required billions of dollars in investment, so far unrecouped, and huge amounts of energy, enough to extend the lives of decades-old coal plants and nuclear reactors. Companies insist that efficiencies are adding up every day. They also hope to drive down errors to the point of winning over more users. But no one has truly figured out how to generate a reliable return or spare the climate.\n\nAnd Google faces one challenge that its competitors don’t: In the coming years, up to a quarter of its search ad revenue could be lost to antitrust judgments, according to JP Morgan analyst Doug Anmuth. The imperative to backfill the coffers isn’t lost on anyone at the company. Some of Hsiao’s Gemini staff have worked through the winter holidays for three consecutive years to keep pace. Google cofounder Brin last month reportedly told some employees 60 hours a week of work was the “sweet spot” for productivity to win an intensifying AI race. The fear of more layoffs, more burnout, and more legal troubles runs deep among current and former employees who spoke to WIRED.\n\nOne Google researcher and a high-ranking colleague say the pervasive feeling is unease. Generative AI clearly is helpful. Even governments that are prone to regulating big tech, such as France’s, are warming up to the technology’s lofty promises. Inside Google DeepMind and during public talks, Hassabis hasn’t relented an inch from his goal of creating artificial general intelligence, a system capable of human-level cognition across a range of tasks. He spends occasional weekends walking around London with his Astra prototype, getting a taste of a future in which the entire physical world, from that Thames duck over there to this Georgian manor over here, is searchable. But AGI will require systems to get better at reasoning, planning, and taking charge.\n\nIn January, OpenAI took a step toward that future by letting the public in on another experiment: its long-awaited Operator service, a so-called agentic AI that can act well beyond the chatbot window. Operator can click and type on websites just as a person would to execute chores like booking a trip or filling out a form. For the moment, it performs these tasks much more slowly and cautiously than a human would, and at a steep cost for its unreliability (available as part of a $200 monthly plan). Google, naturally, is working to bring agentic features to its coming models too. Where the current Gemini can help you develop a meal plan, the next one will place your ingredients in an online shopping cart. Maybe the one after that will give you real-time feedback on your onion-chopping technique.\n\nAs always, moving quickly may mean gaffing often. In late January, before the Super Bowl, Google released an ad in which Gemini was caught in a slipup even more laughably wrong than Bard’s telescope mistake: It estimated that half or more of all the cheese consumed on Earth is gouda. As Gemini grows from a sometimes-credible facts machine to an intimate part of human lives—life coach, all-seeing assistant—Pichai says that Google is proceeding cautiously. Back on top at last, though, he and the other Google executives may never want to get caught from behind again. The race goes on.\n\nUpdated 3/21/2025, 4 PM EDT: Wired has clarified the context of a quote attributed to Pandu Nayak.\n\nLet us know what you think about this article. Submit a letter to the editor at mail@wired.com.",
    "date": "2025-03-21T10:00:00Z"
  },
  {
    "url": "https://www.ign.com/articles/assassins-creed-shadows-crosses-1-million-players-on-launch-day-ubisoft-says",
    "title": "Assassin’s Creed Shadows Crosses 1 Million Players on Launch Day, Ubisoft Says",
    "content": "Assassin’s Creed Shadows saw over 1 million players on launch day, Ubisoft has announced.\n\nThe game released on PC, PlayStation 5, and Xbox Series X and S on March 20, and just before 4pm in Canada, Ubisoft took to social media to say it had crossed the 1 million player mark.\n\n“It's not even 4pm here in Canada and Assassin's Creed Shadows has already passed 1 million players!” Ubisoft said.\n\n“Thank YOU from the bottom of our hearts for joining this adventure in Feudal Japan. We are beyond excited to start this journey with you!”\n\nPlay\n\nWhile 1 million players on launch day is an impressive achievement, it’s difficult to gauge success when Ubisoft itself hasn’t offered a sales figure or indeed a sales target.\n\nWhat we do know is that Assassin’s Creed Shadows is the top-selling video game globally on Steam right now. Valve’s chart sorts products by revenue, so we can say Ubisoft’s game is currently bringing in more money than any other on the platform.\n\nWe also have early days Steam concurrent figures. According to official stats from Valve’s platform, Assassin’s Creed Shadows hit a peak player concurrent figure of 41,412 on Steam on launch day. Assassin’s Creed Shadows released on a Thursday, so it is expected that that figure will grow as we head into the game’s first weekend on sale. We’ll have a better picture of its performance on Steam next week and in the weeks ahead. Neither Sony nor Microsoft make player numbers public.\n\nFor some context, BioWare’s single-player RPG Dragon Age: The Veilguard launched on Steam on Thursday, October 31, 2024, and saw a peak of 70,414 players on Valve’s platform.\n\nThe Complete Assassin's Creed Timeline 25 Images\n\nThere is enormous pressure on Assassin's Creed Shadows to do well for Ubisoft globally after multiple delays and the sales failure of last year’s Star Wars Outlaws . Indeed, Ubisoft has suffered a number of high-profile flops , layoffs , studio closures , and game cancellations in the run up to Assassin's Creed Shadows' release. Things have got so bad at Ubisoft that its founding Guillemot family and largest shareholder have reportedly been exploring talks with Chinese mega-corp Tencent and other investors on a buyout deal that would let them preserve control.\n\nAssassin's Creed Shadows has also endured a number of controversies, not least in Japan. Yesterday, IGN confirmed that Ubisoft had quietly released a day-one patch for Assassin’s Creed Shadows that made a number of important changes seemingly in response to concern from some Japanese politicians about in-game temples and shrines.\n\nIn a remarkable exchange this week, Japanese politician and member of the House of Councillors of Japan, Hiroyuki Kada, raised the issue of Assassin’s Creed Shadows in an official government meeting, and Shigeru Ishiba, the Prime Minister of Japan, responded.\n\nAssassin's Creed Shadows - Early Skills Tier List Assassin's Creed Shadows - Early Skills Tier List\n\nOn Steam at least, Assassin's Creed Shadows is going down very well with players. It has a 'very positive' user review rating, with 82% of the near 4,000 user reviews marked as positive. IGN’s Assassin’s Creed Shadows review returned an 8/10. We said: “By sharpening the edges of its existing systems, Assassin’s Creed Shadows creates one of the best versions of the open-world style it’s been honing for the last decade.”\n\nAdventuring across feudal Japan? Check out our comprehensive Assassin's Creed Shadows guide, including our Assassin's Creed Shadows walkthrough, our detailed Assassin's Creed Shadows Interactive Map, and our guide to all the crucial things Assassin’s Creed Shadows doesn’t tell you.\n\nWesley is the UK News Editor for IGN. Find him on Twitter at @wyp100. You can reach Wesley at wesley_yinpoole@ign.com or confidentially at wyp100@proton.me.",
    "date": "2025-03-21T09:50:35Z"
  },
  {
    "url": "https://arstechnica.com/ai/2025/03/why-anthropics-claude-still-hasnt-beaten-pokemon/",
    "title": "Why Anthropic’s Claude still hasn’t beaten Pokémon",
    "content": "In recent months, the AI industry's biggest boosters have started converging on a public expectation that we're on the verge of “artificial general intelligence” (AGI)—virtual agents that can match or surpass \"human-level\" understanding and performance on most cognitive tasks.\n\nOpenAI is quietly seeding expectations for a \"PhD-level\" AI agent that could operate autonomously at the level of a \"high-income knowledge worker\" in the near future. Elon Musk says that \"we'll have AI smarter than any one human probably\" by the end of 2025. Anthropic CEO Dario Amodei thinks it might take a bit longer but similarly says it's plausible that AI will be \"better than humans at almost everything\" by the end of 2027.\n\nA few researchers at Anthropic have, over the past year, had a part-time obsession with a peculiar problem. Can Claude play Pokémon? A thread: pic.twitter.com/K8SkNXCxYJ — Anthropic (@AnthropicAI) February 25, 2025\n\nLast month, Anthropic presented its “Claude Plays Pokémon” experiment as a waypoint on the road to that predicted AGI future. It's a project the company said shows \"glimmers of AI systems that tackle challenges with increasing competence, not just through training but with generalized reasoning.\" Anthropic made headlines by trumpeting how Claude 3.7 Sonnet’s \"improved reasoning capabilities\" let the company's latest model make progress in the popular old-school Game Boy RPG in ways \"that older models had little hope of achieving.\"\n\nWhile Claude models from just a year ago struggled even to leave the game’s opening area, Claude 3.7 Sonnet was able to make progress by collecting multiple in-game Gym Badges in a relatively small number of in-game actions. That breakthrough, Anthropic wrote, was because the “extended thinking” by Claude 3.7 Sonnet means the new model \"plans ahead, remembers its objectives, and adapts when initial strategies fail\" in a way that its predecessors didn’t. Those things, Anthropic brags, are \"critical skills for battling pixelated gym leaders. And, we posit, in solving real-world problems too.\"\n\nCredit: Anthropic Over the last year, new Claude models have shown quick progress in reaching new Pokémon milestones. Credit: Anthropic Over the last year, new Claude models have shown quick progress in reaching new Pokémon milestones.\n\nBut relative success over previous models is not the same as absolute success over the game in its entirety. In the weeks since Claude Plays Pokémon was first made public, thousands of Twitch viewers have watched Claude struggle to make consistent progress in the game. Despite long \"thinking\" pauses between each move—during which viewers can read printouts of the system’s simulated reasoning process—Claude frequently finds itself pointlessly revisiting completed towns, getting stuck in blind corners of the map for extended periods, or fruitlessly talking to the same unhelpful NPC over and over, to cite just a few examples of distinctly sub-human in-game performance.",
    "date": "2025-03-21T13:49:17Z"
  },
  {
    "url": "http://9to5google.com/2025/03/21/samsung-galaxy-android-15-initial-list/",
    "title": "Samsung confirms initial list of Galaxy devices getting Android 15",
    "content": "One UI 7 is finally nearing the end of testing and will soon be available to users in a stable format starting in April outside of the Galaxy S25 series. Samsung listed a number of Galaxy devices that would be eligible for the Android 15 update repackaged as Samsung’s One UI 7.\n\nOne UI 7 carries a hefty number of changes that could potentially go unnoticed if the user doesn’t really care about AI. Fortunately, Samsung has been doing a good job of inserting AI features that don’t come off as gimmicks, like translation and messaging tools. One UI 7 also brings a different approach to notifications and Quick Settings, which is a divisive one.\n\nSamsung’s Android 15 update was originally rolled out with the Galaxy S25 series. The Galaxy S24 lineup and foldable have been left in a beta phase that has lasted longer than anticipated. So what comes next?\n\nAccording to Samsung, Android 15 will officially roll out to over 15 devices starting on April 7. Samsung provided a small list of devices getting the update, to begin with, which includes some devices that were left in beta for way too long.\n\nAdvertisement - scroll for more content\n\nIt looks like Samsung will start with the Galaxy S24 series and work its way backward through the S series.\n\nGalaxy S24 series\n\nGalaxy S24 FE\n\nGalaxy S23 series\n\nGalaxy S23 FE\n\nGalaxy S22 series\n\nGalaxy S21 series\n\nGalaxy S21 FE\n\nSamsung also plans to bring Android 15 to foldables, spanning all the way back to the Galaxy Z Fold/Flip 3. Beyond that, the Galaxy Tab S10 and S9 series will get the update, though it’s unclear if that includes the FE models.\n\nGalaxy Z Fold 6\n\nGalaxy Z Flip 6\n\nGalaxy Z Fold 5\n\nGalaxy Z Flip 5\n\nGalaxy Z Fold 4\n\nGalaxy Z Flip 4\n\nGalaxy Z Fold 3\n\nGalaxy Z Flip 3\n\nGalaxy Tab S10 series\n\nGalaxy Tab S9 series\n\nGalaxy Tab S9 FE series\n\nGalaxy Tab S8 series\n\nGalaxy Tab S6 Lite\n\nDetails on timing are pretty scarce, and they’ll likely remain so as Samsung will likely play the majority of the rollout by ear as updates become available. The S24 series will very likely be first, with the following lineups coming in close behind. The list may also expand to more devices in time. This is a big step in the right direction, though the OS upgrade has been far delayed already.\n\nMore on Samsung:",
    "date": "2025-03-21T13:20:48Z"
  },
  {
    "url": "https://www.eurogamer.net/nintendo-switch-online-adding-four-more-snes-games",
    "title": "Nintendo Switch Online adding four more SNES games",
    "content": "Nintendo has announced its next batch of SNES games headed to the Switch Online catalogue - and there's a pretty obvious nod to Assassin's Creed Shadows on the list.\n\nFour strategy games from Koei all arrive for Switch Online next Friday, 28th March, including two Nobunaga's Ambition titles.\n\nNobunaga's Ambition lets you compete for control of Japan either as the infamous Oda Nobunaga or his rivals as they attempt to unify the country. This is the same conflict that plays out over the course of Ubisoft's new Feudal Japan-set Assassin's Creed, in which Oda Nobunaga is also a key figure.\n\nComing to Nintendo Switch Online next week are:\n\nNobunaga's Ambition\n\nNobunaga's Ambition: Lord of Darkness\n\nRomance of the Three Kingdoms 4: Wall of Fire\n\nUncharted Water: New Horizons\n\nAnd you can watch footage of all four games in the video below:\n\n28th March is also when SNES game Super Soccer will be delisted from Nintendo's Switch Online catalogue, at least in Japan - the first game to disappear from the subscription service.\n\nEurogamer previously contacted Nintendo for more information on why the game will be removed, and whether this removal will also take place elsewhere in the world. We're yet to receive any more information there.\n\nYou can check out the full run down of everything available on Nintendo's subscription service via our handy guide detailing all the Nintendo Switch Online games available to play right now.",
    "date": "2025-03-21T10:41:21Z"
  },
  {
    "url": "https://www.wired.com/story/google-openai-gemini-chatgpt-artificial-intelligence/",
    "title": "Inside Google’s Two-Year Frenzy to Catch Up With OpenAI",
    "content": "But more piles of fascinating research are only useful to Google if they generate that most important of outputs: profit. Most customers generally aren’t yet willing to pay for AI features directly, so the company may be looking to sell ads in the Gemini app. That’s a classic strategy for Google, of course, one that long ago spread to the rest of Silicon Valley: Give us your data, your time, and your attention, check the box on our terms of service that releases us from liability, and we won’t charge you a dime for this cool tool we built.\n\nFor now, according to data from Sensor Tower, OpenAI’s estimated 600 million all-time global app installs for ChatGPT dwarf Google’s 140 million for the Gemini app. And there are plenty of other chatbots in this AI race too—Claude, Copilot, Grok, DeepSeek, Llama, Perplexity—many of them backed by Google’s biggest and best-funded competitors (or, in the case of Claude, Google itself). The entire industry, not just Google, struggles with the fact that generative AI systems have required billions of dollars in investment, so far unrecouped, and huge amounts of energy, enough to extend the lives of decades-old coal plants and nuclear reactors. Companies insist that efficiencies are adding up every day. They also hope to drive down errors to the point of winning over more users. But no one has truly figured out how to generate a reliable return or spare the climate.\n\nAnd Google faces one challenge that its competitors don’t: In the coming years, up to a quarter of its search ad revenue could be lost to antitrust judgments, according to JP Morgan analyst Doug Anmuth. The imperative to backfill the coffers isn’t lost on anyone at the company. Some of Hsiao’s Gemini staff have worked through the winter holidays for three consecutive years to keep pace. Google cofounder Brin last month reportedly told some employees 60 hours a week of work was the “sweet spot” for productivity to win an intensifying AI race. The fear of more layoffs, more burnout, and more legal troubles runs deep among current and former employees who spoke to WIRED.\n\nOne Google researcher and a high-ranking colleague say the pervasive feeling is unease. Generative AI clearly is helpful. Even governments that are prone to regulating big tech, such as France’s, are warming up to the technology’s lofty promises. Inside Google DeepMind and during public talks, Hassabis hasn’t relented an inch from his goal of creating artificial general intelligence, a system capable of human-level cognition across a range of tasks. He spends occasional weekends walking around London with his Astra prototype, getting a taste of a future in which the entire physical world, from that Thames duck over there to this Georgian manor over here, is searchable. But AGI will require systems to get better at reasoning, planning, and taking charge.\n\nIn January, OpenAI took a step toward that future by letting the public in on another experiment: its long-awaited Operator service, a so-called agentic AI that can act well beyond the chatbot window. Operator can click and type on websites just as a person would to execute chores like booking a trip or filling out a form. For the moment, it performs these tasks much more slowly and cautiously than a human would, and at a steep cost for its unreliability (available as part of a $200 monthly plan). Google, naturally, is working to bring agentic features to its coming models too. Where the current Gemini can help you develop a meal plan, the next one will place your ingredients in an online shopping cart. Maybe the one after that will give you real-time feedback on your onion-chopping technique.\n\nAs always, moving quickly may mean gaffing often. In late January, before the Super Bowl, Google released an ad in which Gemini was caught in a slipup even more laughably wrong than Bard’s telescope mistake: It estimated that half or more of all the cheese consumed on Earth is gouda. As Gemini grows from a sometimes-credible facts machine to an intimate part of human lives—life coach, all-seeing assistant—Pichai says that Google is proceeding cautiously. Back on top at last, though, he and the other Google executives may never want to get caught from behind again. The race goes on.\n\nUpdated 3/21/2025, 4 PM EDT: Wired has clarified the context of a quote attributed to Pandu Nayak.\n\nLet us know what you think about this article. Submit a letter to the editor at mail@wired.com.",
    "date": "2025-03-21T10:00:00Z"
  },
  {
    "url": "https://www.ign.com/articles/assassins-creed-shadows-crosses-1-million-players-on-launch-day-ubisoft-says",
    "title": "Assassin’s Creed Shadows Crosses 1 Million Players on Launch Day, Ubisoft Says",
    "content": "Assassin’s Creed Shadows saw over 1 million players on launch day, Ubisoft has announced.\n\nThe game released on PC, PlayStation 5, and Xbox Series X and S on March 20, and just before 4pm in Canada, Ubisoft took to social media to say it had crossed the 1 million player mark.\n\n“It's not even 4pm here in Canada and Assassin's Creed Shadows has already passed 1 million players!” Ubisoft said.\n\n“Thank YOU from the bottom of our hearts for joining this adventure in Feudal Japan. We are beyond excited to start this journey with you!”\n\nPlay\n\nWhile 1 million players on launch day is an impressive achievement, it’s difficult to gauge success when Ubisoft itself hasn’t offered a sales figure or indeed a sales target.\n\nWhat we do know is that Assassin’s Creed Shadows is the top-selling video game globally on Steam right now. Valve’s chart sorts products by revenue, so we can say Ubisoft’s game is currently bringing in more money than any other on the platform.\n\nWe also have early days Steam concurrent figures. According to official stats from Valve’s platform, Assassin’s Creed Shadows hit a peak player concurrent figure of 41,412 on Steam on launch day. Assassin’s Creed Shadows released on a Thursday, so it is expected that that figure will grow as we head into the game’s first weekend on sale. We’ll have a better picture of its performance on Steam next week and in the weeks ahead. Neither Sony nor Microsoft make player numbers public.\n\nFor some context, BioWare’s single-player RPG Dragon Age: The Veilguard launched on Steam on Thursday, October 31, 2024, and saw a peak of 70,414 players on Valve’s platform.\n\nThe Complete Assassin's Creed Timeline 25 Images\n\nThere is enormous pressure on Assassin's Creed Shadows to do well for Ubisoft globally after multiple delays and the sales failure of last year’s Star Wars Outlaws . Indeed, Ubisoft has suffered a number of high-profile flops , layoffs , studio closures , and game cancellations in the run up to Assassin's Creed Shadows' release. Things have got so bad at Ubisoft that its founding Guillemot family and largest shareholder have reportedly been exploring talks with Chinese mega-corp Tencent and other investors on a buyout deal that would let them preserve control.\n\nAssassin's Creed Shadows has also endured a number of controversies, not least in Japan. Yesterday, IGN confirmed that Ubisoft had quietly released a day-one patch for Assassin’s Creed Shadows that made a number of important changes seemingly in response to concern from some Japanese politicians about in-game temples and shrines.\n\nIn a remarkable exchange this week, Japanese politician and member of the House of Councillors of Japan, Hiroyuki Kada, raised the issue of Assassin’s Creed Shadows in an official government meeting, and Shigeru Ishiba, the Prime Minister of Japan, responded.\n\nAssassin's Creed Shadows - Early Skills Tier List Assassin's Creed Shadows - Early Skills Tier List\n\nOn Steam at least, Assassin's Creed Shadows is going down very well with players. It has a 'very positive' user review rating, with 82% of the near 4,000 user reviews marked as positive. IGN’s Assassin’s Creed Shadows review returned an 8/10. We said: “By sharpening the edges of its existing systems, Assassin’s Creed Shadows creates one of the best versions of the open-world style it’s been honing for the last decade.”\n\nAdventuring across feudal Japan? Check out our comprehensive Assassin's Creed Shadows guide, including our Assassin's Creed Shadows walkthrough, our detailed Assassin's Creed Shadows Interactive Map, and our guide to all the crucial things Assassin’s Creed Shadows doesn’t tell you.\n\nWesley is the UK News Editor for IGN. Find him on Twitter at @wyp100. You can reach Wesley at wesley_yinpoole@ign.com or confidentially at wyp100@proton.me.",
    "date": "2025-03-21T09:50:35Z"
  }
]